theory lab1
imports Main

begin

term "x::nat" (* Создание термы x - натурального числа *)
term "(2::nat) + 2" (* Создание термы 2+2 - натурального числа *)

(* term "\<not>0" (* incompatible operand type *) *)
term "x / 0" (* хорошо типизированный *)
  
value "13 + 7" (* результатом служит сумма единиц в виде, удобном для параллельных вычислений 
в количестве, равном результату вычисления 13+7; тип результата - неопределенный; 
продолжить вычисления нельзя, т.к. выражение является редуцированным  *)
value "(13::nat) + (7::nat)" (* результатом служит сумма, полученная путем увеличения 0 
на столько единиц, сколько будет при операции 13+7 - исходя из индуктивного определения nat через 0 
и Suc; тип результата - натуральное число; продолжить вычисления нельзя, т.к.
 выражение является редуцированным  *)
  
(* 4 задание отдельно *)
  
value "(Suc (Suc (Suc Zero))) + (Suc (Suc Zero))"
value "(Suc (Suc (Suc Zero))) * (Suc (Suc Zero))" 
 
value "(\<lambda>y. y+y)" (* запись функции через лямбда *)
value "(\<lambda>y. y+y) 2::nat" (* тип nat *)  
value "(\<lambda>y. y+y) p" (* неопред. тип *)
value "(\<lambda>y. y+y) (r+1)" (* неопред. тип *)
  
end